"use strict"; // Этот код работает в современном режиме
//комментарий
/*
Многострочный
комментарий
*/
/*
------------████████--------████████------------------███
----------██--------██----██--------██------------------███
--------------------██----██--------██-----████████-----███
----------------███----------██████---------------------███
------------███-----------██--------██-----████████-----███
----------██--------------██--------██------------------███
----------███████████-------████████------------------███
*/

let text = 'String';                                  // Строка - string - str
let numbers = 10;                                     // Число - integer - int
let name = ['Nickolay', 'Ivan', 'Roman', 'Bogdan'];   // Массив - array
  console.log(name[1]);                               // Вывод переменной

alert ('Push the button');
